Revit 2026 API

# ApplicationDocuments Property

---

Returns a set of documents within Revit.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual DocumentSet Documents { get; }
```
```vb
Public Overridable ReadOnly Property Documents As DocumentSet
	Get
```
```cpp
public:
virtual property DocumentSet^ Documents {
	DocumentSet^ get ();
}
```
```fsharp
abstract Documents : DocumentSet with get
override Documents : DocumentSet with get
```

#### Property Value

DocumentSet

This property can be used for the user to find all the document inside Revit.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace